{"id":731334,"title":"第 7 章 通用人工智能之路","content":"<blockquote> <p>所有的故事都是一个，那就是我们如何走到今天。</p> <p style=\"text-align: right\">——题记</p> </blockquote><h2 id=\"nav_point_47\">哥伦布的出发</h2><p>1492 年初，航海家哥伦布正在进行一场艰难的谈判，谈判的另一方是西班牙王室费迪南国王和伊莎贝拉女王。这是一场对人类现代科技史至关重要的融资。中国元朝时期，一代天骄元太祖成吉思汗东征西战，威震四方。在成吉思汗的统治下，欧洲人通过丝绸之路与东方国家进行贸易，享有很长一段时间的安定与和平。但是，随着 1453 年君士坦丁堡的陷落，丝绸之路被迫关闭，欧洲人获得香料、丝绸、瓷器的供应链被迫中断，因此他们迫切需要寻求新的东方贸易路线。此时，葡萄牙探险家已经通过非洲南端的好望角开辟了通往东方的向东 A 路线。其他探险家也都渴求开拓一条新的海上路线。哥伦布提出直接向西航行穿越大西洋抵达东印度群岛的向西 B 路线，这个想法建立在地球为球形的前提下。</p><p>哥伦布进行这次谈判并非一时兴起，而是经过了十多年的准备和尝试。早在 20 多年前，天文学家就曾声称向西航行是可以抵达东方的，哥伦布对此深信不疑。哥伦布极富天分，自学成才，加上为了实现绕地球另一侧航行的目标，他雄心勃勃地阅读了大量书籍，并做了几百个标注，其中就包括马可·波罗的《马可·波罗游记》。著名的威尼斯商人、探险家马可·波罗早在哥伦布出生之前的 170 多年就抵达了中国元朝大都。在中国游历期间，马可·波罗展现了他的聪明才智，元朝皇帝忽必烈非常喜欢马可·波罗，封了他很多官衔，还派遣他作为使者到各地巡查。元朝时期，中国的许多城市比欧洲先进，这让马可·波罗非常仰慕中国文化。他曾在扬州担任了 3 年地方长官，今天的扬州还有马可·波罗纪念馆。在返回威尼斯后的一场海战中，马可·波罗不幸被俘，被关进了监狱。中世纪时期的监狱环境恶劣，但幸运的是，马可·波罗结识了一位聊得来的狱友，他将自己在中国的经历和盘托出。而这位狱友便把他的传奇经历记录了下来，写成了对欧洲人影响深远的《马可·波罗游记》。很多探险家看了此书后，相信东方是一个遍地黄金和香料、充满诱惑的地方。</p><!-- [[[read_end]]] --><p>当时的欧洲因气候原因，香料产量很低，只能依赖进口。欧洲人对香料极度渴求，以至于香料和黄金一样昂贵。从现代生命科学的角度来看，香料的本质是抗氧化剂，不仅增香添味，而且确实有抗氧化和消炎的功效。同时，欧洲也因地理环境等各种原因，没有像中国那样长期统一过。可以说，欧洲的历史就像是中国春秋战国时期的历史，小国林立，大国争霸。在这样的背景下，游历各个国家并争取支持成了哥伦布等探险家必然的选择，就像是先贤孔子周游列国一样。</p><p>1484 年，带着去东方探险的梦想，哥伦布向葡萄牙国王寻求赞助。葡萄牙国王在询问了航海顾问后，认为哥伦布的向西路线不可行，就拒绝了他。两年后，哥伦布又向西班牙女王伊莎贝拉提出了他的航海计划，他被同样的理由拒绝。尽管如此，女王为了给未来的合作留有余地，还是给了他一笔小钱补贴生活。这有些像今天的创业投资：当一个天才创业者提出了一个天马行空、不太靠谱的创业想法时，投资人偶尔也可能为了未来的合作，少投一点儿意思一下。</p><p>哥伦布并没有就此放弃。1488 年，哥伦布第二次向葡萄牙国王提出计划，再次遭到了拒绝。几年后，西班牙女王伊莎贝拉又送给哥伦布一小笔钱，意思了一下。可见西班牙王室是认可哥伦布的才华的。终于，1492 年，哥伦布得到了伊莎贝拉女王的召唤，获得了一次宝贵的融资谈判机会。谈判非常艰难，伊莎贝拉女王认为哥伦布太过贪婪，索要的太多。比如，哥伦布要求担任新发现土地的总督并永久获得新土地上产生的所有收入的 10% 的报酬等。此外，还有很多来自各方的阻力，比如，不少西班牙船员对哥伦布的计划表示怀疑，认为不断向西航行的 B 路线会让船走到大海边缘或是掉到什么可怕的地方。最关键的是，西班牙因为战争国库空虚，不堪远航的巨额成本。谈判失败了，哥伦布失落地背起行囊，带着他的大航海计划准备前往法国。</p><p>哥伦布离开后，西班牙王室才意识到哥伦布航海计划的重要性。而真正说服王室的人是路易斯·桑坦格尔。他是当时一名成功的商人，愿意一起投资支持哥伦布的航海计划。而真正打动女王的是，桑坦格尔强调了哥伦布的航海计划将使西班牙变得富裕和繁荣，有助于基督教的传播。他还指出，如果一个敌对的王国资助了哥伦布，那么西班牙将失去这个宝贵的机会。这种“极限推拉”不禁让人想起如今的巨头投资或收购行为。一想到自己的竞争对手做出了投资或者收购了目标标的，而自己会错失机会，巨头往往就会果断出手。这样的博弈逻辑，早在 500 多年前就有，至今未变。</p><p>这场戏剧性故事的最后，是女王让王室卫兵快马加鞭去追赶哥伦布。而这时哥伦布已走出了 10 千米之外，即将前往法国去“推销”他的航海计划。最终，哥伦布被卫兵追到，并返回西班牙宫廷。</p><p>1492 年 4 月 17 日，哥伦布和西班牙王室最终达成了一项协议，即“圣塔菲协议”。王室向哥伦布承诺，如果他成功发现新土地，将被授予海军上将及所发现土地和岛屿的总督头衔，有权获得新土地上所有交易商品利润的 10%。哥伦布终于融资成功。同年 8 月 3 日，哥伦布率领 3 艘帆船从西班牙南部的一个海边小镇出发，驶进了茫茫大海，开始了他的探险旅程。</p><h2 id=\"nav_point_48\">DeepMind 的出发</h2><p>2010 年，AI 科学家杰米斯·哈萨比斯来到旧金山参加奇点峰会，想为他的通用人工智能项目融资。奇点峰会由非营利组织 AI 奇点研究所（SIAI）举办，旨在探讨 AI 技术可能带来的影响。奇点是一个非常酷的概念，该理论认为，人类正逐渐接近一个人类文明无法掌控的技术拐点，即技术奇点。到达这个点之后，技术将自我加速并不断进化，超越人类智慧的速度会迅速加快，人类将无法掌控其发展，进而面临被毁灭的风险。因为这种超越人类智慧的技术是 AI 技术，所以这个奇点也称“AI 奇点”。</p><p>2006 年，AI 奇点研究所在硅谷投资人彼得·蒂尔的资助下，与斯坦福大学合作，发起了奇点峰会，以深入探讨 AI 的未来和风险。彼得·蒂尔最早和埃隆·马斯克一样，曾为互联网支付公司贝宝（PayPal）工作，两人都被称为“贝宝帮”<span class=\"comment-number\">1</span> 成员。从贝宝成功退出后，彼得·蒂尔获取了巨额财富。2004 年，彼得·蒂尔用一小笔投资得到了一位哈佛大学辍学生所创建的公司 10% 的股份，这家公司就是后来的社交网络巨头 Facebook。除此之外，他还投资了很多像 SpaceX、Quora 这样的世界知名的科技公司，这为他带来了超过 1 万倍的财务回报，使他成为硅谷的传奇人物。</p><p>哈萨比斯参加奇点峰会，是希望展示他的技术路线和理想，并与彼得·蒂尔好好交流一下。在这样的峰会上，如果发表的演讲采用普通的题目，是不好意思和人打招呼的。但是哈萨比斯可不是普通人，他的演讲题目是“构建通用人工智能的系统神经科学方法”，题目直击“AI 领域的圣杯”——通用人工智能。通用人工智能是这个星球上，自从有人类历史以来，在重要程度和困难级别上同时达到人类所面临的挑战顶峰的事物。</p><p>1956 年的达特茅斯会议首次提出 AI 这个概念。自此，AI 经历了第一次浪潮、第一次寒冬、第二次浪潮、第二次寒冬以及第三次浪潮。哈萨比斯在出席奇点峰会时，AI 的第三次浪潮刚刚兴起。此时的 AI 已经能够完成不少任务了，比如字符识别、语音识别、图像识别、翻译等。但是每个 AI 算法只能解决一个特定问题，且效果不是很理想，这种 AI 被称为弱人工智能。强人工智能，即通用人工智能，则像人一样拥有通用能力，可以解决多种多样的任务。</p><p>弱人工智能和通用人工智能的区别，就像动物和人类之间的区别。每个动物只会几个独特技能，往往没有扩展性，比如猫抓老鼠、鹦鹉学舌、蜘蛛结网。而人类通过学习和发展工具，几乎可以胜任任何任务。人类也可以抓老鼠、学外语和结网。通用人工智能的目标正是要实现匹配人类所有能力的通用智能。</p><p>AI 的发展曾经让几代从业人员感到失望，他们努力后发现，AI 完全无法达到通用人工智能的水平，甚至在单项技能上的表现也很糟糕。Meta 公司 AI 研究实验室负责人、法国 AI 专家杨立昆也曾在专访中说：“即便是最先进的 AI 系统也存在局限性，它们还不如一只猫聪明。”</p><p>在计算机的理论模型图灵机被创造之前，图灵就梦想让机器拥有人类的思维。为了表彰图灵的杰出贡献，美国计算机协会在图灵逝世后设立了“计算机领域的诺贝尔奖”——图灵奖，作为对计算机领域的最高成就的认可。通用人工智能代表着一种完全可以取代人类智慧的 AI 系统，其突破性将改变人类的生产力和文明进程。在计算机和互联网被发明之后，通用人工智能是极少数可能会对全人类生产力起到巨大加速作用的科技创新。我们目前甚至想象不到比通用人工智能更重要的事了，因为通用人工智能可以帮助控制核聚变，从而永久解决全球的能源问题。哈萨比斯正在对这个“AI 领域的圣杯”发起挑战。</p><p>哈萨比斯从小就被称为神童，聪明绝顶。互联网发明者蒂姆·伯纳斯–李曾评价他为“地球上最聪明的人”。哈萨比斯 4 岁就开始下国际象棋，5 岁参加了全国比赛，6 岁时赢得了 8 岁以内组冠军，13 岁时获得了“国际象棋大师”的头衔，曾 5 次获得“智力奥运会”精英赛冠军。哈萨比斯的才华不仅仅是在棋局上，在他 22 岁时创立游戏公司的几年后，他发现游戏市场被大公司垄断，独立游戏公司很难取得突破。于是，他决定关闭公司，重新研究脑科学的基本原理，试图在人脑中寻找新的 AI 算法的灵感，为实现通用人工智能的突破而努力。</p><p>2009 年，33 岁的哈萨比斯取得了伦敦大学学院认知神经科学博士学位。此时，他对游戏、脑科学、AI 的深入理解推动他创立了一家通用人工智能公司。</p><p>终于，在 2010 年的奇点峰会上，哈萨比斯的精彩演讲引起了彼得·蒂尔的注意，并被邀请到彼得·蒂尔的别墅详谈。第二天，哈萨比斯和合伙人走进彼得·蒂尔的家，他们被家中的装潢和客厅的围棋所吸引，这可是哈萨比斯擅长的棋类游戏。哈萨比斯并没有主动开始聊融资问题，他知道，要建立一个成功的公司，不只需要谈论融资，更要先建立有效的社交关系。他主动聊起了国际象棋，谈起了他对国际象棋的深度理解，比如马和象的紧张关系正是国际象棋的魅力所在。这让彼得·蒂尔对他产生了兴趣，并约他次日再来家里。</p><p>第二次见面时，哈萨比斯深入阐述了他的通用人工智能理想，认为通过游戏来模拟人脑可以实现相当高水平的 AI。彼得·蒂尔感到非常惊讶，说这事儿可能有点儿大。作为在投资上获取过 1 万倍收益的人，彼得·蒂尔难得给出这样的评价。他对这个方向表示了赞赏。</p><p>几周后，哈萨比斯拿到了彼得·蒂尔 140 万英镑的投资意向金。加上其他投资者的支持，哈萨比斯一共筹集到了 200 万英镑，他的愿望即将实现。2010 年 9 月，哈萨比斯的新公司 DeepMind 正式起航。</p><h2 id=\"nav_point_49\">OpenAI 的出发</h2><p>2015 年 6 月的一个晚上，硅谷精英们聚集在美国门洛帕克市的瑰丽酒店，参加了一场晚宴。硅谷位于地震带，这里的楼房低矮。夜晚的瑰丽酒店十分静谧。马斯克也是参会者之一，他在这里参会非常方便，因为他长期住在这家奢华酒店里，思考如何拯救特斯拉的产能爬坡问题。组织晚宴的是山姆·阿尔特曼，他在硅谷人脉广泛，就像月光社<span class=\"comment-number\">2</span> 的发起人马修·博尔顿一样。山姆拥有远大的理想和宽广的视野，曾发行过世界币，投资过可控核聚变能源公司，他希望有一天能够彻底解决人类的能源问题。</p><p>聪明的头脑是同频的。大家第一次被阿尔特曼召集在一起，探讨问题，大家的疑惑很多，不同的思想火花不断碰撞、发酵。大家也被肩膀宽厚、富有魅力的马斯克所感染，像他这样推动世界改变的人总是有很强的扭曲力场。</p><p>马斯克是特斯拉电动车公司和 SpaceX 的 CEO 兼投资人，他坚信，未来人类不用自己开车，因为自动驾驶终将实现。同时，人类也需登陆火星，以便给人类繁衍做物种备份。这两件事都需要强人工智能技术的支持。但是，当时的 AI 技术基本上被谷歌、微软、Facebook 垄断。马斯克在 2014 年说过：“AI 是人类的最大威胁。”他认为，AI 掌控在少数大公司手中，有失控的危险，世界需要一个不受这些公司控制的开源 AI。</p><p>那天参加晚宴的还有伊利亚，他是欣顿的学生。2012 年，欣顿的深度学习团队以 4400 万美元的天价被谷歌收购后，伊利亚就此进入谷歌 AI 团队。伊利亚和他的同事通过努力，把谷歌翻译推高到了新的水平。</p><p>参加晚宴的还有格雷格·布罗克曼。此前一个月，他刚刚从独角兽公司 Stripe 的 CTO 岗位上离职，当时的 Stripe 已经估值 50 亿美元。在晚宴上，他被现场的气氛深深感染，当场表示：“我能想象到的最好的事情，就是让人类更接近于以安全的方式构建真正的 AI。”尽管他过去的从业经历和 AI 关系不大，完全没有 AI 经验，但是他非常有兴趣来组建新的 AI 实验室，其丰富的 CTO 经验也让他成为合适的创始人人选。</p><p>兴奋之余，大家也不免开始自我怀疑起来。在谷歌、微软等科技巨头中，已经有了很多 AI 专家和技术牛人，他们拥有丰厚的薪酬和舒适的工作环境。相比之下，OpenAI 是一家小型的非营利机构，表面上看，它的实力似乎与那些大公司相差甚远。舍弃过去的一切来干一件新事儿，是需要谨慎思考的。</p><p>布罗克曼对 AI 领域还很陌生，于是他给几个人打了电话，其中包括后来荣获图灵奖的约书亚·本吉奥。本吉奥给他列了 AI 领域的技术牛人清单。布罗克曼花了一些时间逐一联络。根据对方对组建 AI 实验室这件事的反馈，布罗克曼最终挑选出 10 位精英工程师，并邀请他们参加周末酒会，酒会的地点定在硅谷向北一小时车程的纳帕谷葡萄酒庄。有美酒美食，还有技术大神，这样放松愉悦的氛围让这些工程师感受到了大家对 AI 未来的激情。布罗克曼在聚会中向他们发起邀请，并给了他们 3 周的考虑时间。</p><p>当一群思维同频的人面对面聚在一起时，总会发生奇妙的化学反应：3 周后，10 个人中的 9 位决定加入这个全新的 AI 实验室，如此高的加入率不同寻常。</p><p>这 9 位同意加盟 OpenAI 的人，就包括那天参加瑰丽酒店晚宴的伊利亚，他后来担任了 OpenAI 的首席科学家。伊利亚曾提到，他之所以选择 OpenAI，部分原因是这里有强大的团队。此外，更重要的原因是它能够推进数字智能，为人类福祉做贡献，而不是追求短期的财务回报。在参加纳帕谷聚会时，伊利亚的内心已经非常确认，未来的方向就是通用人工智能。</p><p>创始团队组建完毕后，他们给这家非营利性的 AI 实验室起名为 OpenAI，中文意为“开放 AI”。2015 年 12 月，马斯克、阿尔特曼、布罗克曼、彼得·蒂尔、AWS 等投资方宣布成立 OpenAI，并承诺对 OpenAI 投资超过 10 亿美元。OpenAI 最初的目标并非推动通用人工智能的发展，而是做出最有助于改进人类福祉、不被大公司垄断、人人皆可受益的开放 AI。相比在 2010 年启程的 DeepMind，OpenAI 这艘大船晚开了 5 年，但是总算启航了。</p><h2 id=\"nav_point_50\">哥伦布的远航</h2><p>哥伦布是意大利人，虽然得到了西班牙女王的支持，但当地的西班牙水手并不信任他。虽然当时大家都已经相信地球是圆的，但大海的边缘是否存在深渊还是令人生疑。在哥伦布之前，所有的航海家都是沿着海岸走，从未有人沿着纬线向大洋深处航行过。幸运的是，西班牙船长平松相信哥伦布的向西 B 计划，还很想和他一起出海。平松在本地非常受人尊敬，在他的支持下，哥伦布凑齐了 3 艘船和大约 90 个人扬帆起航。他们准备了足以维持几个月生存的给养，不仅有葡萄酒、水、醋、咸鱼、猪肉和牛肉，还有羊毛帽子和玻璃球等西班牙手工艺品，用于到达陆地后与人交换食物。他们还带了鲜活的鸡，以提供新鲜鸡肉和鸡蛋。</p><p>哥伦布敢于扬帆出海，一半是勇气，一半是错误。他相信只要按照 B 路线向西航行，就一定会到达陆地。哥伦布当时对地球周长的估算比实际少了整整一半。哥伦布计算他到达日本群岛的距离是 2700 英里 <span class=\"comment-number\">3</span>，而实际距离是 1 万英里。可见哥伦布不仅没有正确的地图，而且数学还不太好。如果不是中间隔着一个美洲大陆，他的船需要航行 4 个月才能到达陆地，他的团队成员将生死难料。历史的一半往往是由谬误组成的，错上加错、将错就错其实是历史的常态。</p><p>1492 年 8 月 3 日，哥伦布出发后，首先沿着海岸向西南航行。很快就出现了一些小麻烦：最小的“尼娜号”帆船因为用的是三角帆，所以只要风向一变，船员就需要不断地将船帆从一侧移到另一侧。没隔几天，“平塔号”的船舵从固定装置上掉了下来，他们很快修好了，然后又掉了。于是众人开始怀疑有两个船员故意搞破坏，因为这两个船员在出行前就犹豫不决、反复无常。好在平松船长有勇有谋，让大家多少有些宽慰。按照计划，他们很快到达了西班牙的加那利群岛。在那里休整了几天之后，这些问题都被解决了。</p><p>1492 年 9 月 10 日，哥伦布的船队离开加那利群岛，再次出发。这次航行一直向西。这个决定基于哥伦布对大海主风向规律的深刻理解。由于大西洋的环形海风带，这条航线上的风助力十足。相反，如果从西班牙一启航就直接向西，一路上就凶多吉少了。</p><p>然而，面对欧洲人从未航行过的海域，哥伦布还是非常担心。他遭遇了“平塔号”的船舵被故意破坏的情况，因此他认为人心不稳是这次航行最大的威胁。为了安抚船员，哥伦布决定编造一份假的航海日记，让大家认为航行距离其实不算远。在 500 多年前的大航海时代，所有的船长几乎每天都会记录航海日记，日后日记会成为载誉而归的证据。就像我们现在的极限运动员一样，在渺无人烟的地方，必须用运动相机记录下自己的精彩瞬间。哥伦布同时写着两份航海日记，一真一假，他故意把假日记的航行距离写小一半。后来人们发现，其实假日记上的数字更接近他们的真实航程。</p><p>一周后，船队发现海上漂浮着一大片海藻，这往往是附近就有陆地的标志。然而，他们继续前进后发现只有海岛，宽阔的大海一望无际，并没有陆地的踪迹。又过了一周，平松船长喊道，他看到了西南方的陆地。哥伦布当即跪地感谢上帝，船员们也都唱起了圣歌。可是第二天他们发现地面变成了云朵。</p><p>在茫茫的大海上，人的意志显得非常渺小。绝大多数船员和船长相信神灵的庇护。每天早上他们唱圣歌，向上帝祈祷。但是，一个月的航行时间已经过去，完全没有看到陆地的迹象，所有的船员都开始焦躁不安，恐慌在慢慢蔓延。</p><p>1492 年 10 月 7 日，船员们看到一大群候鸟向西南方飞去，这让所有的人都非常惊喜和振奋。哥伦布判断这些候鸟一定在飞向陆地。于是他果断下令改变航向，向着候鸟飞去的方向继续航行。经过三天三夜的艰苦航行，他们依旧没有发现任何陆地的迹象，茫茫大海让所有人都感到绝望和疲惫。船员们的希望又一次破灭了，人们的焦躁和不安达到了顶点。他们开始围在哥伦布的身边，抗议航行，希望船长按原路返航，放他们回家。</p><h2 id=\"nav_point_51\">DeepMind 的远航</h2><p>2013 年，DeepMind 这艘大船已经驶出 3 年了，“船员们”还没有看到陆地。从解决游戏问题开始，“船员们”不断把 AI 推到更高的水平，进而逐渐实现强人工智能。这看起来似乎是一条非常正确的路，但实际上并非一帆风顺。</p><p>从 20 世纪 50 年代开始，游戏就一直是 AI 的试验场，因为游戏拥有明确的目标和规则、相对可控的环境以及丰富的历史数据。1997 年，IBM 的“深蓝”超级计算机在国际象棋比赛中战胜了人类国际象棋大师卡斯帕罗夫，这场人机大战举世瞩目。DeepMind 开始从红白机游戏入手，尝试用游戏来测试 AI 的智能性。因为胜利和失败很容易量化，所以这样做有助于研究者评估算法的性能。</p><p>DeepMind 最拿手的是利用红白机消砖块游戏作为 AI 的测试场景。程序员给 AI 程序输入视频流的像素数据。一开始时，程序总会把弹球漏掉，从而输掉游戏。但是，神经网络在玩了成千上万次消砖块游戏后，就逐渐学会了这个游戏。神奇的是，在经过充分训练后，神经网络独立地发现了人类才会用的一个技巧，那就是把小球反弹到彩砖墙的上面去，让小球在砖块和墙之间进行快速高频反弹，如图 7-1 所示。神经网络表现出的这一学习能力超过了人类，而这种学习方式就是强化学习。</p><p class=\"pic\"><img img=\"\" src=\"https://static001.geekbang.org/files/resource/ebook/100001/Images/image00231.jpeg\" alt=\"{%}\"></p><p class=\"ebook-image-title\"><strong>图 7-1 神经网络的学习能力</strong></p><p>DeepMind 把神经网络玩消砖块游戏的视频发给了美国风险投资基金 Founders Fund 的联合创始人卢克·诺塞克。他和马斯克一样，都是传奇的“贝宝帮”的一员。两人在马斯克的私人飞机上一起观看了这段视频。谷歌创始人之一拉里·佩奇无意中听到了他们的对话。亿万富翁的缘分就是这样。2013 年年底，拉里·佩奇派遣团队和欣顿一起，前往伦敦洽谈收购 DeepMind 的事宜。但是，由于欣顿有腰椎间盘突出的风险，几乎不太可能从硅谷坐跨洋飞机飞到伦敦，于是他们租用了一架私人飞机，把欣顿固定在一张平板床上跨越了大西洋。</p><p>成立了 3 年，DeepMind 还没有开始盈利，它只能给一流的 AI 研究员开得起 10 万美元的年薪。同样的人才在谷歌的年薪会是 30 万～ 50 万美元。杰米斯·哈萨比斯原本想让 DeepMind 坚持独立发展 20 年，但当他看到谷歌的团队乘坐跨洋私人飞机来谈收购时，他就知道自己的公司几乎不太可能独立发展了，因为如果此次收购不成，谷歌、Facebook 和微软将以 3 ～ 5 倍的薪资挖走他的团队里的所有人才。</p><p>2014 年，谷歌宣布以 6 亿美元收购 DeepMind。在哈萨比斯的坚持下，他拿到了 DeepMind 在英国伦敦独立发展的许可。这次收购让天使投资人彼得·蒂尔投资的 140 万英镑获得了 5000% 的回报，也让 2011 年投资 DeepMind 的马斯克收获了数千万美元的回报。</p><p>加入谷歌后，DeepMind 在强化学习这条路上突飞猛进。随着 AI 水平逐渐提高，它能够获胜的游戏越来越多。自然而然，哈萨比斯将目标移向了人类智力游戏的顶峰——围棋。通过把人类历史上的 3000 万步棋输入神经网络进行训练，AlphaGo 在 2016 年战胜了人类围棋世界冠军李世石，登上了舞台中央，站在了聚光灯下。2017 年，AlphaGo 设立了大约 1000 万元人民币的总奖金，与中国棋手柯洁对战。毫无悬念，AI 以 3 比 0 赢了比赛。</p><p>在围棋这项游戏中，AI 战胜人类这一事实让全球震惊。通过在游戏中不断强化学习，AI 可以在通用人工智能之路上不断地迈进，这看起来前途无量。DeepMind 成了 AI 研究的灯塔，把强化学习推到了前所未有的水平。DeepMind 的惊世表现获取了谷歌的大量资源支持。利用深度学习算法，DeepMind 已经成功帮助谷歌数据中心的冷却系统节约用电 40%。DeepMind 的深层神经网络每隔 5 分钟就从谷歌数据中心的冷却系统中获取数据，用来预测潜在行为的不同组合对未来的能源消耗的影响。这让谷歌在几年内节省了数亿美元的电费，同时还减少了对环境的影响。仅仅节省的电费就让谷歌收回了收购 DeepMind 时付出的部分成本。</p><p>就在 AlphaGo 战胜柯洁的 2017 年，DeepMind 的兄弟部门谷歌大脑团队发表了一篇关于 Transformer 架构的论文。从那时起，事情在悄悄发生变化。DeepMind 成立之初无意中撒下的一颗种子正在悄悄生根发芽，这颗种子也让行进在另一条航线上的大船，奋起直追，去追赶通用人工智能目标。</p><h2 id=\"nav_point_52\">OpenAI 的远航</h2><p>2015 年 12 月，在 OpenAI 成立后的几小时，其首席科学家伊利亚走进了由 Facebook 举办的一个聚会。聚会快要结束时，杨立昆找到他说，“你加入 OpenAI 是一个错误，你会失败的”。杨立昆明确地给出了他的理由：OpenAI 的员工普遍年轻，缺乏经验，而且与 Facebook 和谷歌这样的大公司竞争，很难留住人才，其非营利的模式难以持续发展。就在两年前，这位“卷积神经网络之父”组建了 Facebook 的 AI 实验室，他的话听起来似乎不无道理。</p><p>尽管如此，伊利亚还是坚持自己的选择，下定决心要这么干。</p><p>早在 DeepMind 成立的第二年（2011 年），还在加拿大多伦多大学上学的伊利亚来到英国伦敦参加实习生的面试。面试官是哈萨比斯和 DeepMind 的另一位创始人沙恩·莱格。在面试中，哈萨比斯向伊利亚讲述了通过游戏场景有望实现通用人工智能的理想目标。伊利亚心想，从游戏出发解决问题是不错的思路，但是通用人工智能这个目标实在荒谬，这不是一个认真的 AI 研究者现在该考虑的问题，太不靠谱。伊利亚有些不以为然，并返回了学校。后来，他和老师欣顿、同学亚历克斯的三人团队被谷歌以 4400 万美元的惊天价格收购，他也就此加入了谷歌大脑实验室。</p><p>加入谷歌大脑实验室后，伊利亚感受到了这里的一切和学校的学术实验室的巨大差异。在这里，他不再是一个象牙塔里的研究者，而是加入了一个庞大的研究团队，有着海量的计算资源和无限的创意空间。这让伊利亚大开眼界、又惊又喜。在谷歌大脑实验室，伊利亚参与了和 DeepMind 合作的项目，飞到伦敦工作了两个月。这两个月的经历让伊利亚感觉，他当初的想法可能错了，他曾认为不太现实的通用人工智能并非遥不可及。伊利亚开始相信，将通用人工智能作为目标有助于自己深入思考。</p><p>谷歌从不缺少异想天开的人，而伊利亚的想法可以说是疯狂的。原本思维就无边无际的他，开始思考到底怎样才能实现远远超越人类思维的智能机器——一种可以开车、读书、聊天、思考的智能机器。很多聪明人从未认真想过实现通用人工智能的具体做法和条件。伊利亚发现，他的想法越来越接近 DeepMind 在面试他时所提到的那个无人能及的目标。</p><p>2014 年，也就是谷歌收购 DeepMind 的这一年，伊利亚在谷歌大脑实验室的机器翻译工作取得了巨大进展。他引入新的深度学习模型，将过去的翻译效果提升了一大截，完胜全世界其他的翻译团队。当时，一些研究人员并不相信神经网络可以做翻译，而伊利亚的成果令他们大吃一惊。伊利亚曾说：“如果你有一个非常大的数据库和一个非常大的神经网络，那么你必然可以得到一个性能最优的翻译机器。”</p><p>2015 年，伊利亚在两位创始人阿尔特曼和布罗克曼的邀请下，加入 OpenAI 并担任首席科学家一职。尽管谷歌为留住他开出了远远超过 OpenAI 的薪水，伊利亚还是毫不犹豫地拒绝了。</p><p>在 OpenAI 创立后的前几年，团队进行了好几种尝试，例如研发强化学习平台和用强化学习训练实时战略游戏 Dota 的机器人。研发过程中的不少经验后来成为研发 ChatGPT 的基础（ChatGPT 也包含强化学习）。2017 年，谷歌发表了堪称通用人工智能里程碑的论文《注意力就是你所需要的一切》（“Attention Is All You Need”），重点阐述了基于注意力机制的 Transformer 架构。Transformer 点亮了伊利亚的思维火花，这正是他要寻找的工具。</p><p>2018 年，基于伊利亚对语言的深度理解和对注意力机制的研究，OpenAI 成功研发出了大语言模型的第一个版本 GPT-1，其网络参数量为 1.1 亿。它基于 Transformer 架构，成为第一代生成式预训练模型。所谓“生成式”，就是给定 <em>n</em> 个词，去推测下一个词在最大概率上会是什么。这一生成过程，如果用最简单的比喻形容，就像是写作文。GPT-1 的诞生是深度学习领域的一个分水岭，AI 的发展从此走上了不同的道路。走这条路并不是一个轻松的决定，因为这意味着大量的资金消耗。</p><p>然而，在这场竞赛中，OpenAI 的投资人马斯克却逐渐退出了团队。2018 年，也就是 OpenAI 刚刚发布 GPT-1 的时候，马斯克由于需要全力解决特斯拉和 SpaceX 的“大量令人痛苦的工程和制造问题”，几乎退出了对 OpenAI 的指导工作。更为关键的是，马斯克开始不可避免地从 OpenAI 挖人了，因为特斯拉不得不解决 AI 自动驾驶中的关键问题。2019 年年初，马斯克发了一条推文宣布了分手：“特斯拉正与 OpenAI 争夺一些相同的人才。我不认同 OpenAI 团队想要做的一些事情。综上所述，大家最好友好分手。”</p><p>在马斯克和 OpenAI 处于基本分手状态的 2018 年，随着预训练模型规模的不断扩大，OpenAI 的支出成本急剧攀升，每年的成本以亿美元计。此外，OpenAI 的众多人才成了谷歌、Facebook 和微软等行业巨头的挖角目标。这些财大气粗的行业巨头往往能开出高出数倍的薪水。钱在流失，人才也在流失，这让 OpenAI 实现原本的理想变得遥遥无期。最大的风险还在于，通用人工智能这条路，到底能不能走通？面对这一困境，阿尔特曼不得不深思这一根本性问题：怎样在非营利的目标下留住人才，支付高昂的研发费用，同时实现通用人工智能造福人类的理想？</p><p>最终的思考结果是：这是完全不可能的。2019 年，OpenAI 做出让步，有限度地修改了非营利的目标。为了实现最终的非营利目标，在实现的过程中可以先获得部分盈利。OpenAI 成立了一个可盈利实体（OpenAI LP）负责融资，来负担愈发昂贵的研发成本。不过公司也宣布会设置盈利上限，即允许投资者获得不超过 100 倍的盈利回报。不久之后，微软宣布向 OpenAI 投资 10 亿美元。微软的入局不仅解决了 OpenAI 的人力成本之困，还为它带来了算力资源。而对微软来说，这也是影响深远、改变自身命运的投资。</p><p>在 2018 年，GPT-1 的发布只在 AI 圈引起了关注。在其发布后大约 4 个月的时候，谷歌就推出了与之针锋相对的 BERT 模型，它同样基于自家的 Transformer 架构。如果简单地概括这两者的区别，那就是 GPT-1 是通过写作文训练长大的，更擅长生成文章，而 BERT 是通过做完形填空训练长大的，更擅长阅读理解。产生这种差异的原因是什么呢？外界可能看不到真正的答案，但一个可能的猜测是：谷歌作为搜索引擎公司，需要一个能够更好理解网页的模型，以为用户提供更精准的搜索结果。而参与研发 GPT-1 的伊利亚对语言有着更本质的思考，他认为人类的思维方式是单向输出，GPT-1 的训练方式更接近人类的语言思维方式。</p><p>之后，OpenAI 和谷歌在大模型领域掀起了一场“军备竞赛”。BERT 在多个自然语言处理任务上比 GPT-1 强了不少。而在 BERT 问世之后仅仅 4 个月里，OpenAI 发布了比上一代大 13 倍的 GPT-2，其参数量高达 15 亿。从此，OpenAI 铁了心要搞大模型，坚定地走在了“越来越大”这条路上。</p><p>2020 年，OpenAI 发布了具有 1750 亿参数的庞然大物 GPT-3。这简直太激进：GPT-3 比 GPT-2 大了足足 100 多倍，是 GPT-1 的 1000 多倍！自此，语言模型正式进入了大模型时代。</p><p>然而，风险和收益如同硬币的两面，它们总是同时存在。由于 OpenAI 修改了非营利目标，特别是在得到微软的投资后，团队中的一些核心成员不满改变而选择离开。2021 年，其研究副总裁达里奥·阿莫迪带着 OpenAI 的近 10 名核心员工创办了一家名为 Anthropic 的 AI 公司。公司成立之初，就获得了 1.24 亿美元的投资，第二年又获得了 5.8 亿美元的投资。总计约 7 亿美元的投资已与 OpenAI 的资本相差不多。</p><p>AI 圈中的“气候”很快发生了变化。2022 年年中，生成式 AI 取得了巨大突破，大家惊艳于 AI 生成的图片无比精美且富有创意。生成式 AI 逐渐火热起来，且投资事件频繁发生。很快，Anthropic 开始内测基于自家大模型的聊天机器人 Claude。到 2022 年 11 月时，正在按部就班专注于 GPT-4 测试的 OpenAI 突然发现，自己未必会被 DeepMind 这艘大船反超，反而可能会被从自家出走的“小弟”——仅成立 1 年多的 Anthropic——反超。此外，比较关键的一点是，Claude 聊天机器人是基于可信的 Transformer 架构，听起来要比 OpenAI 的 GPT-3.5 的理念更先进。虽然还无法得知效果如何，但是“友商”Anthropic 专注于可解释的、透明的神经网络模型，相比 OpenAI 的黑盒模型，更能提高用户对 AI 系统的信任度。</p><p>气氛瞬间开始变得紧张起来。</p><h2 id=\"nav_point_53\">哥伦布登陆</h2><p>1492 年 10 月 10 日，哥伦布的船队从西班牙出发已经两个月了，在加那利群岛休整也满一个月了。焦躁的船员们围着哥伦布，抱怨着这次航行太愚蠢，大家都坚持返航，想要回家。哥伦布也一样为看不到陆地焦虑着，但是，他非常坚定地为船员打气，向船员描述胜利就在眼前的场景：印度群岛仅一步之遥，此时抱怨没有任何意义；一旦到达陆地，就会有丰厚的奖赏。哥伦布的信心传递给了每一个人，船员们的情绪平复了许多，终于安静了下来。其实，哥伦布的坚定源于他真的有信心：自从 3 天前候鸟出现后，他就总能听到鸟叫声，所以他确信陆地真的不远了。</p><p>10 月 11 日，惊喜似乎如约而至。他们发现了漂浮的竹竿，还有一小段显然被人为加工过的木棍。这些迹象让船员们信心倍增，不再提回家了，而是兴奋地加速前行。为了高额的金币奖赏，3 艘帆船全速前进，你追我赶，都希望成为最先发现陆地的船只。</p><p>10 月 12 日凌晨两点，黑暗之处隐约有火光闪现。经过确认，陆地终于出现了。3 艘船都把帆降了下来，等待上岸。天亮时分，哥伦布带领船员们踏上了陌生的土地，见到了一群赤身裸体的土著居民。哥伦布知道，他成功了！他向西航行的 B 路线真的成功了！他喜极而泣，跪地感谢上帝的庇佑，然后宣布，此地归属于西班牙。</p><p>当地的土著居民非常友善和热情，拿出许多鹦鹉和棉线团与他们交换西班牙的玻璃球和羊毛帽子。当地人显然对金属毫无概念，甚至会因为赤手去拿剑刃而受伤。他们只有棍棒这种初级的武器。事实上，在哥伦布到来之时，整个美洲大陆还停留在石器时代，因缺乏铁矿而一直没有“点亮”金属这一技能树。</p><p>随后的一个多月里，他们不断寻找着黄金宝藏。1492 年 11 月 21 日，平松船长突然向其他方向驶去，打算拉着自己的弟弟独立出来去探险，不再听从哥伦布的指挥。愤怒的哥伦布紧追其后，但始终没有追上。</p><p>12 月 24 日，在圣诞节前夕，其中一艘船——“圣玛利亚号”——因船体被船蛆侵蚀而搁浅沉没。1493 年 1 月 1 日，哥伦布担心已经叛变的平松船长回到西班牙向女王汇报，抢占自己的荣誉，于是决定提前返航。在归途中，恶浪咆哮肆虐，哥伦布胆战心惊，很怕自己命丧归途，让本应属于自己的荣耀被他人夺走。</p><p>1493 年 3 月 15 日，哥伦布终于抵达西班牙港口，随即通过陆路赶往巴塞罗那。虽然女王早已得知平松船长归来的消息，但她拒绝在哥伦布回来之前接见他。平松船长落寞地返回自己的家中，据说后来他郁郁而终。</p><p>国王和女王为哥伦布举办了隆重的欢迎仪式，而哥伦布发现新大陆的消息迅速传遍了巴塞罗那。在哥伦布骑马去往宫殿的大街上，人们纷纷涌上街头，瞻仰这位他们心目中的英雄。哥伦布也领来他带回来的土著居民泰诺人和鲜艳的鹦鹉入宫，以证明他确实抵达了新大陆。对于打出生起只住过草屋的泰诺人来说，如此富丽堂皇的宫殿令他们叹为观止，仿佛置身于穿越后的异世。</p><p>一去一回历经 8 个月的冒险，哥伦布向国王、女王和大臣们讲述着他的经历和发现。大家听得入了神，问题也接连不断。很快，哥伦布便得到了第二次资助，这一次几千名渴望通过探险暴富的年轻人纷纷报名。最终，哥伦布率队 1200 多人，浩浩荡荡地开始了第二次航行。哥伦布总共进行了 4 次远航。最终，哥伦布没有死在汹涌的大海上，而是于 1506 年 5 月 20 日在家中逝世。</p><p>哥伦布的航海探险开启了大航海时代，它被认为是中世纪和近代史的分界点。在随后的几个世纪里，哥伦布都被认为是冒险精神的象征，被尊奉为英雄。在美洲驯化的土豆、番茄、玉米、辣椒等美食传到了欧洲，如此高产量的农作物让欧洲人口增加，而欧洲也带给美洲先进的灌溉技术。欧洲与美洲相互交换了物种、宗教、文化等，这场规模庞大的系统性交换被称为“哥伦布大交换”。</p><p>然而，这些只是硬币的一面。硬币的另一面是，哥伦布发现美洲大陆的壮举给当地的土著居民带去了无尽的灾难。除了欧洲殖民带来的战争破坏，欧洲的疾病也开始在美洲土著居民中传播，死亡率高达 90%，死亡人数达数千万。</p><h2 id=\"nav_point_54\">谷歌推迟登陆</h2><p>2022 年，已在谷歌工作 7 年的软件工程师布莱克·莱莫恩几个月来一直与谷歌的经理、高管和人力资源负责人吵架，他声称聊天机器人 LaMDA 拥有了意识和灵魂。布莱克在谷歌 AI 伦理小组工作，负责审查大模型在性别、身份和宗教等主题上是否有偏见。他声称 LaMDA 已经相当于一个七八岁的孩子，应该在对 LaMDA 做实验前征求机器人的允许。当然，谷歌的管理层完全不相信这一点，在调查后认定 LaMDA 不可能有意识，并认为布莱克有些精神错乱了。</p><p>“他们一再怀疑我是否神志正常，”布莱克说，“他们说：‘你最近看过精神科医生吗？’”</p><p>但布莱克还是坚持 LaMDA 是有意识的。</p><p>受到来自公司的巨大压力，处于矛盾之中的布莱克开始向外界爆料。2022 年 6 月 11 日，《华盛顿邮报》对这件事的报道引发了全球热议：“谷歌工程师布莱克·莱莫恩因为向高管汇报聊天机器人 LaMDA 已经变得有知觉力，而被安排带薪休假。”这则消息震惊了整个科技圈，也引发了人们对 AI 是否真的具备自我意识的话题进行深入讨论。布莱克接受采访时说，在 LaMDA 对于自我认同、道德价值观和阿西莫夫的机器人三定律等问题做出回答后，他得出了这样一个结论：LaMDA 已经具备了自我认知和自我意识。当然，谷歌公司对于这一说法进行了强烈驳斥，并表示有大量证据表明，LaMDA 并不具备自我意识。布莱克进一步透露了聊天机器人 LaMDA 是美国宪法规定的“一个人”，并将其与“起源于地球的外星智能”进行比较。他还说，LaMDA 聊天机器人要求他聘请一名律师。</p><p>2022 年 7 月 22 日，谷歌以违反保密协议为由宣布解雇布莱克。尽管业内的 AI 专家纷纷否定布莱克，声称目前的 AI 不可能具有意识，认为布莱克走火入魔了，但是该事件引发的巨大争议促使谷歌高管决定不向公众发布 LaMDA。</p><p>无独有偶。早在 2015 年，谷歌就推出了云相册的智能分类功能。例如，把飞机、汽车、自行车、餐厅、大厦等自动归类到分类文件夹里。一天，黑人兄弟杰基·阿尔西尼震惊地发现，自己和女朋友的任何新增照片，不断被谷歌云相册归入大猩猩相册里。阿尔西尼被气炸了，他上 Twitter 大骂谷歌。</p><p>在欧美国家，种族歧视是很敏感的问题。发现这个致命错误后，谷歌官方立即道歉，并立即从云端删除了大猩猩的分类。为了避免任何误伤，即便有真的大猩猩，也不会归入任何类别了。谷歌承认，受限于 AI 的水平，实现 100% 的精确度几乎是不可能的。</p><p>谷歌用户早已超过 10 亿，所以在推出任何新产品时，谷歌可能都会冒着被骂后立即下架的风险，特别是具有黑盒属性的 AI 产品。所以，尽管谷歌很早就有接近发布状态的聊天机器人，但是迟迟没有对外发布。</p><p>2020 年 6 月，在 OpenAI 发布了参数量高达 1750 亿的庞然大物 GPT-3 后，DeepMind 也不甘示弱，终于在 2022 年 1 月，发布了龙猫模型（Chinchilla），声称具备 700 亿参数的龙猫模型在很多任务上的执行效果要好于 GPT-3。</p><p>2022 年 3 月，谷歌的机器人团队发布了参数规模高达 5600 亿的多模态大模型 PaLM-E。与 GPT-3 不同，PaLM-E 能看见物体，是一个视觉通才。PaLM-E 可以操纵机械臂完成倒咖啡的操作。</p><p>虽然 DeepMind 和谷歌都在 AI 的发展航向上有序推进，但是由于种种原因，在 2022 年，他们都没有面向大众推出自家的聊天机器人。</p><h2 id=\"nav_point_55\">OpenAI 几乎登陆</h2><p>由于 OpenAI 的 CTO 米拉·穆拉蒂极为低调，几乎从不接受采访，因此下面的故事未见于正式的新闻报道。据说，在 2022 年 11 月中旬，米拉紧急召集团队开会，要求在两周内就上线 ChatGPT。OpenAI 作为一家非营利机构，通常处于平静稳健的研发节奏中。这是因为，算法和模型的迭代往往需要持续很久，例如 GPT-1、GPT-2、GPT-3 分别发布于 2018 年、2019 年、2020 年。</p><p>但是当听说 Anthropic 正在内测聊天机器人 Claude 时，OpenAI 不得不加快节奏。Anthropic 的创始人丹妮拉·阿莫迪和达里奥·阿莫迪都是 OpenAI 的前高管，由于理念不合而出走 OpenAI，自立门户。</p><p>由于长时间积累了 know-how 的核心诀窍，离开公司、自立门户的人往往比其他人威胁更大。</p><p>下面让我们请 ChatGPT 举例说明什么是 know-how，如图 7-2 所示。</p><p class=\"pic\"><img img=\"\" src=\"https://static001.geekbang.org/files/resource/ebook/100001/Images/image00232.jpeg\" alt=\"{%}\"></p><p class=\"ebook-image-title\"><strong>图 7-2 ChatGPT 举例说明什么是 know-how</strong></p><p>通常踩过许多坑的人知道怎样才能跑得通。万一在关键处没有走对，踩到坑里，可能就爬不上来了。所以，在 OpenAI 看来，Anthropic 可能比谷歌的威胁更大。为了保护自由竞争，在美国，没有什么竞业协议。哪怕是一个人离开公司后的第一天，他（她）都可以去竞争对手那里上班。</p><p>2019 年，微软投资了 OpenAI，而 GPT-3 在 2020 年时的水平就已经有了飞跃。所以，谷歌投资 OpenAI 的竞争对手 Anthropic 就是很自然的一件事了。在 2022 年年底，谷歌的投资应该就接近尾声了。</p><p>OpenAI 的系列 GPT 模型由伊利亚负责，而 GPT 模型落地后的 ChatGPT 由 CTO 米拉负责。总之，ChatGPT 被下令必须在两周内推出。</p><p>终于，在 2022 年 11 月 30 日，ChatGPT 正式上线了。后来的事情众所周知，ChatGPT 的智能涌现几乎让所有人惊叹，开始的种种调侃 ChatGPT 的段子也迅速传播起来。</p><p>ChatGPT 刚刚上线两周，用户量达到了 100 万。</p><p>ChatGPT 上线两个月，用户量达到了 1 亿。相关调查显示，将近 90% 的美国大学生使用 ChatGPT。这是一个极为恐怖的扩散速度。</p><p>英伟达创始人黄仁勋反复评论说，ChatGPT 就是 AI 的“iPhone 时刻”；微软联合创始人比尔·盖茨说，ChatGPT 的重要性不亚于个人计算机和互联网的诞生。</p><p>ChatGPT 将重塑一切行业的预测变得越来越合理，它在投资圈、创业圈、互联网圈掀起了持续的讨论浪潮。ChatGPT 的直播链接也在社交网络中此起彼伏。</p><p>从此，ChatGPT 改变了一切。</p><h2 id=\"nav_point_56\">通用人工智能的大航海时代</h2><p>通用人工智能的大航海时代开启了。不仅仅是大型企业，还有无数的创业者、研究员、投资人投身其中。自 2022 年开始，AIGC 浪潮迅速升温。而 ChatGPT 一经推出，又猛烈地掀起了一波 AI 浪潮，它在短时间内就拥有了 1 亿用户的奇迹，刺激着每个关注它的人的神经。</p><p>2023 年 2 月 7 日，微软宣布推出集成了 ChatGPT 的新搜索引擎——New Bing（发音为“牛并”，确实给人一种很牛的感觉）。</p><p>2023 年 2 月 22 日，知名笔记软件 Notion 正式发布集成了 GPT-3 模型的 Notion AI，它让用户在笔记内就可以体验文字优化、头脑风暴等 AI 辅助功能，效果惊艳。</p><p>2023 年 2 月 24 日，Meta 发布了多个参数版本的大模型 LLaMA，最大的模型参数量为 650 亿。LLaMA 的某些版本号称超过了 GPT-3。下面是一个参数量为 650 亿的 LLaMA 的例子。</p><p>我们来看一下 LLaMA 写的一段冥王星和太阳之间的对话。众所周知，冥王星原先被认为是太阳系第九大行星，但是后来天文学家发现冥王星不该被称为行星，太阳系应该只有八大行星。下面是 LLaMA 给出的对话。</p><blockquote> <p>太阳：嘿，冥王星，怎么样啊？</p> <p>冥王星：没什么，我就待在太阳系的边缘。</p> <p>太阳：是啊，我一直想和你谈谈这个问题。你不再是行星了。</p> <p>冥王星：什么？拜托，这不公平。</p> <p>太阳：很抱歉，但事实就是这样。你现在不再符合行星的标准了。</p> <p>冥王星：这太不公平了！我已经是行星 70 多年了！</p> <p>太阳：事情会变化的，冥王星。你必须接受现实。</p> <p>冥王星：去你的，太阳！去你和你那愚蠢的太阳系！</p> </blockquote><p>效果相当不错，很多人写不出这么有趣的对话。</p><p>根据上面的叙事逻辑，你是不是认为人类已经在通用人工智能的大航海旅程中登陆了呢？答案是并没有，事情仍在发展之中。</p><p>一个 AI 需要通过什么样的测试标准，才算是通用人工智能？其实很简单，就是通过人类的考试。很多人类考试可以在线进行了，所以如果 AI 能够在多个测试中超过人类，我们就可以说，AI 是一个通才，是通用人工智能。</p><p>2023 年 3 月 14 日，这一天是圆周率日。OpenAI 发布了 GPT-4，效果极为惊艳。在多个人类任务测试中，它超越了 90% 的人类。GPT-4 在美国律师资格考试中，成绩排名在前 10%；在美国高考的读写考试中，成绩排名前 7%；而在生物学奥林匹克竞赛中成绩更是达到了前 1%，完全可以拿国际金牌。不客气地说，这个水平已经远远超过了大部分人的智力巅峰，它在中国可以轻轻松松地考上 985 学校。不知道你看到这样的结果会有什么感想。我的一个朋友说，看到 GPT-4 的成绩，突然感觉自己很没用。让我们一起看个小例子，看看 GPT-3.5 和 GPT-4 有什么不同，如图 7-3 所示。</p><p class=\"pic\"><img img=\"\" src=\"https://static001.geekbang.org/files/resource/ebook/100001/Images/image00233.jpeg\" alt=\"{%}\"></p><p class=\"ebook-image-title\"><strong>图 7-3 与 GPT-3.5 的对话</strong></p><p>看来，GPT-3.5 还很不会来事儿。再试试 GPT-4，如图 7-4 所示。</p><p class=\"pic\"><img img=\"\" src=\"https://static001.geekbang.org/files/resource/ebook/100001/Images/image00234.jpeg\" alt=\"{%}\"></p><p class=\"ebook-image-title\"><strong>图 7-4 与 GPT-4 的对话</strong></p><p>这么看，GPT-4 已经很懂如何聊天了。</p><p>微软研究院系统性地测试了 GPT-4，并得出一个可怕的结论：“它可以合理地被视为通用人工智能系统的早期（但仍不完整）版本。”微软的技术报告显示，在多个任务测试中，GPT-4 超过了 90% 的人类。看起来，因为发布了 ChatGPT，至少 OpenAI 已经登上了离某个新大陆不远的海岛，距离通用人工智能的新大陆已经不远了。也就是说，OpenAI 已经非常接近通用人工智能的目标了。</p><p>在通用人工智能的大航海时代，启航出发的不仅仅有美国，还有中国。在大模型的全球竞争中，中国是唯一有机会比肩美国的国家。</p><p>2023 年 4 月 22 日，专注于投资中国早期创业者的奇绩创坛创始人兼 CEO 陆奇在上海举办了一场演讲，在演讲中“拐点”这个词被提及数十次，陆奇声称大模型是历史性的拐点。陆奇是著名的中国 AI 布道人，他在演讲中分享道：“我个人过去 10 个月，每天看东西是挺多的，但最近实在受不了。就真的是跟不上。发展速度非常非常快。最近我们开始发行‘大模型日报’，是我实在不行了，论文实在是跟不上，代码实在是跟不上——just too much（太多了）……”自 2023 年春节开始，关于大模型的新闻应接不暇。</p><p>2023 年 3 月 14 日，就在 OpenAI 发布 GPT-4 的同一天，清华大学创业公司智谱 AI 的首席科学家唐杰教授在微博宣布 ChatGLM 聊天机器人开启邀请制内测，它是基于千亿参数的大模型。</p><p>2023 年 3 月 16 日，百度发布了文心一言，而且支持 AI 生成图片。多年的持续投入让百度第一个推出了国产的大模型聊天机器人。</p><p>2023 年 4 月 9 日，在 360 集团主办的 2023 年数字安全与发展高峰论坛上，360 集团创始人周鸿祎发布了基于 360GPT 大模型开发的人工智能产品矩阵——“智脑”。</p><p>2023 年 4 月 11 日的阿里云峰会上，阿里云正式宣布推出大模型聊天机器人通义千问。通义千问具备多轮对话、文案创作、逻辑推理、多模态理解、多语言支持等能力。</p><p>2023 年 4 月，昆仑万维发布“天工”3.5 大模型，并于 4 月 17 日正式启动邀请测试。昆仑万维声称，在“未来 10 年将坚定地‘All in’AGI 与 AIGC”。</p><p>与此同时，垂直大模型和大模型生态也渐渐兴起，通用人工智能的热带森林正在生长。</p><p>2023 年 3 月 23 日，ChatGPT 发布了备受关注的插件系统 Plugin，通过调用 API，ChatGPT 开始拥有连接应用的能力，例如可以通过聊天点外卖和购物。2023 年 3 月 30 日，彭博社创始人迈克尔·布隆伯格发布了金融领域的第一个大模型 BloombergGPT，专门针对金融领域的数据进行训练。布隆伯格拥有超过 40 年的金融文档和数据。同一天，一款开源模型 AutoGPT 发布。如果给定一个任务，AutoGPT 依靠 ChatGPT 的能力可以自主拆解任务、自己使用第三方工具、自己操作计算机，它已成为一款数字版的自动机器人。新的、令人眼花缭乱的 AI 工具层出不穷、日新月异，正在奔向通用人工智能的前沿道路上野蛮生长。</p><p>最后，我想分享一个发现。在写到本章时，我发现谷歌和 OpenAI 有一个非常微妙但惊人的共同点，那就是目前全球排名第一的 AI 团队 OpenAI 的技术源头和至少曾经全球排名第二的 AI 团队 DeepMind 的技术源头竟然都不是硅谷，而是英国伦敦。但这两家公司现在都是硅谷公司。DeepMind 的创始人哈萨比斯来自英国伦敦，其团队至今在英国伦敦办公，而 OpenAI 的首席科学家伊利亚来自欣顿的工作室，而欣顿也出生在伦敦。这说明英国在第一次科技革命——机械革命——中遗留下来的丰厚遗产（虽然没有直接关系）孕育了这两条技术路线，但最终还是流向了美国。而在第二次科技革命——电力革命——发生后，世界的重心也从英国转向了美国。这说明，科技革命关乎国运，每一次科技革命就是生产力的革命。如果抓住机会，就会拿到未来大国崛起的船票。</p><p>哥伦布、DeepMind 和 OpenAI 这 3 个故事，实际上是一个故事。地球上发生的所有故事，其实都只有一个，那就是人类是如何走到今天的，我们的命运是如何交织相连的。哥伦布在 1492 年发现美洲大陆后，美洲盛产的白银被运到欧洲，后来又流向中国，用来买茶叶和瓷器。而白银大量流入中国的结果是严重的通货膨胀，最终可能加速了明朝的灭亡和清军入关。“哥伦布大交换”给欧洲带来了高产的玉米和土豆，极大地促进了欧洲人口的增长，为珍妮纺纱机和蒸汽机的诞生创造了需求和动力，促进了第一次科技革命的诞生。“哥伦布大交换”中引进的高产农作物也为中国带来了巨大的好处，促进了农业生产，进而推动了中国人口的增长。</p><p>而最重要的巨变在于，在哥伦布发现美洲大陆之前，全球是独立发展的，几乎没有全球化。在哥伦布发现美洲大陆之后，全球化迅速展开，全球命运就此相连。</p><p>随着通用人工智能的临近，人类面临的风险也与日俱增。登上新大陆就是好事吗？印第安人可不会这么认为。在“哥伦布大交换”中，疾病的传播使整个美洲大陆的印第安人的人口在一两个世纪内减少了 90%以上。而通用人工智能这块新大陆带来了新的智力资源，可以极大提升人类生产力，但是也可能会打开潘多拉的盒子，释放恶魔。</p><p>那么，我们可能就此停下脚步吗？不可能，因为这是一场博弈。至少数年内，以大模型为基础的 AI 仍然会带来显著的收益，且所有的技术性突破、教育的解放、全人类的生产力提高，都依赖 AI 的继续提升。</p><p>通用人工智能的征途远未结束，人类不可能停下脚步，因为一切才刚刚开始。</p><p class=\"pic\"><img img=\"\" src=\"https://static001.geekbang.org/files/resource/ebook/100001/Images/image00235.jpeg\" alt=\"{%}\"></p><p style=\"text-align: right\"><strong>一个平常的夏日</strong> 作者：凯蒂小姐</p><br style=\"page-break-after:always\"><div style=\"page-break-after:always\"></div>","neighbors":{"left":{"article_title":"第 6 章 ChatGPT 和生成式革命","id":731333},"right":{"article_title":"第 8 章 ChatGPT 和智能涌现","id":731335}},"comments":[]}