{"id":740992,"title":"保罗·格雷厄姆其人其事","content":"\n<p> 1964年，保罗·格雷厄姆出生于匹兹堡郊区的一个中产阶级家庭。父亲是设计核反应堆的物理学家，母亲在家照看他和他的妹妹。</p>\n<p> 青少年时代，格雷厄姆就开始编程。但是，他还喜欢许多与计算机无关的东西，这在编程高手之中是很少见的。中学时，他喜欢写小说；进入康奈尔大学以后，他主修哲学。后来发现哲学很难理解，于是研究生阶段他就去了哈佛大学计算机系，主攻人工智能。</p>\n<p> 他在这个方向上进展不顺利，因此对学术感到灰心。（但是，作为研究工具的Lisp语言，对他日后产生了重大影响。）博士读到一半，他又去哈佛艺术系旁听。拿到博士学位以后，他报名进入罗德岛设计学院暑期班，学习绘画课程，梦想成为画家。</p>\n<p> 上完暑期班，他去了欧洲，在有500年历史的佛罗伦萨美术学院继续学习绘画。第二年，钱花完了，他不得不返回美国，在波士顿的一家创业公司担任程序员。那时是1992年。</p>\n<p> 此后的两三年，格雷厄姆一直过着一种动荡的生活。他栖身于纽约一间极小的公寓，追求自己的艺术家梦想，但是收入低而且不稳定，日子过得非常窘迫，常常入不敷出，他不得不经常替别人编程，赚取一些生活费。</p>\n<p> 终于有一天，格雷厄姆觉得不能再这样继续下去了。“我决定不当画家了，我首先要彻底解决自己的收入问题。”他后来回忆道。</p><!-- [[[read_end]]] -->\n<p> 1995年初夏，他找到了读书时认识的朋友罗伯特·莫里斯（Robert Morris），希望合作编写一个软件来赚钱。后者是一个非常聪明的黑客，曾经在1988年编写了历史上第一个蠕虫病毒——莫里斯蠕虫。</p>\n<p> 那时正赶上第一家互联网公司网景上市，大量的造势广告在媒体上轮番播出，整个资本市场都为“互联网概念”而疯狂。<span class=\"comment-number\">1</span>格雷厄姆心想，如果网景公司的设想是正确的，未来人们都在互联网上购物，那么必须有人为零售商们开发软件。所以，他决定开发一个帮助人们搭建网店的软件。</p>\n\n<p> 莫里斯此时还在麻省理工学院攻读硕士学位，只有暑假才有空。于是，格雷厄姆就搬到莫里斯的公寓。两人利用那一段时间写出了产品原型。</p>\n<p> 一开始，他们的软件完全采用传统模式，即用户首先下载安装，然后在自己的硬盘上做出网店的雏形，最后再上传到服务器。后来，格雷厄姆灵机一动：为什么不让用户通过浏览器直接操作服务器呢！这样就完全省去了安装和上传的步骤。</p>\n<p> 于是，他们改变方向，决定把软件做成一个互联网程序。这是世界上第一个通过互联网使用的软件。因为这一点，他们就把这个产品起名为Viaweb。他们放弃开发桌面软件还有另一个原因，那就是两人都没学过如何开发Windows程序，并且也不太想学。</p>\n<p> 他们拿着产品原型找到了格雷厄姆的美术老师的丈夫，他是一位律师，他同意资助1万美元。这就是当时的全部资金了。他们用这笔钱买了一台服务器，然后着手将原型程序完善为可以演示的Demo版。事情越来越多，两个人忙不过来了，格雷厄姆就问莫里斯：“你的同学之中谁编程最厉害？”回答是特雷弗·布莱克韦尔（Trevor Blackwell）。于是，Viaweb有了第三个创始人。</p>\n<p> 8月初，他们做出了可以上线的Demo版。10月，他们来到纽约，向两个天使投资人展示，希望能够筹集到5万美元。结果，两个投资人都表示愿意投资，于是他们就拿到了10万美元。12月，Viaweb正式开始发展客户。</p>\n<p> 1996年夏天，Viaweb得到了第二轮天使投资80万美元。他们用这笔钱雇了CEO和新程序员，还租了新办公室。此前，他们一直在莫里斯公寓的楼上办公，环境十分简陋，总共只有一台计算机，如果有参观者，还必须借一些计算机来“装门面”。现在，Viaweb终于看上去像一家公司了。也正是从这时开始，有媒体对Viaweb进行报道了，格雷厄姆松了一口气，他们终于不必再依靠用户的口口相传来发展业务了。</p>\n<p> 1996年圣诞节，他们的客户总数达到了70家，其中包括著名摇滚杂志《滚石》。一年后，客户总数增长了5倍，公司看起来发展得很好。在这个过程中，他们一直在四处寻找收购者，因为他们创立Viaweb的主要目的就是希望被收购，这样才能快速赚到钱。他们前后经历的收购谈判不下10次，但是由于种种原因都失败了。</p>\n<p> 1998年，收购终于成功。雅虎以4 900万美元的价格兼并了Viaweb，将其改名为Yahoo Store，这是雅虎最早的收购行动之一。完成收购的那一天，格雷厄姆把莫里斯拉到哈佛广场的美容店里，因为后者曾经在创业初期说过，如果能从Viaweb中赚到100万美元，他就愿意打个耳洞。</p>\n<p> 被收购之后，格雷厄姆就成了雅虎的员工，继续从事编程。他在那里工作了一年半，总是感觉很不自在，不适应雅虎的企业文化，用他自己的话说，就是不习惯大公司的官僚环境，他说：“运营创业公司，每天都像在战斗；而为大公司工作，就像在窒息中挣扎。”于是，他选择了辞职。</p>\n<p> 离开了雅虎，他的生活顿时就空闲了。他开始将自己对于技术和创业的观点写成一系列文章，并发表在个人网站上。这些文章受到读者的好评和追捧，访问量不断上升。2004年，最受欢迎的那部分文章由O'Reilly出版社结集出版，取名为《黑客与画家》，这两个词正是格雷厄姆前半生的人生写照。他在前言中写道：“我们生活中的一切，都正在成为计算机。所以，如果你想理解我们目前的世界以及它的未来动向，那么多了解一些黑客的想法会对你有帮助。”</p>\n<p> 2005年3月，哈佛大学的学生团体“计算机协会”邀请格雷厄姆做演讲。他选择的题目是《如何成立创业公司》。“我对他们说，选择天使投资人的时候，最好选择那些自己有过创业经验的人。”说完这句话，他发现学生都以期待的眼神看着他，他赶紧补充说：“我不是天使投资人。”</p>\n<p> 这句话显然说早了。演讲结束以后，他与学生一起喝咖啡聊天，发现其中有些人很有才干和想法。他不由想到，如果没有天使投资人，Viaweb根本不可能存在，也就不会有现在的自己。于是，他决定为这些学生创造机会，看看他们能做出什么。</p>\n<p> 2005年的暑假，他重新找到了莫里斯（他现在是麻省理工学院计算机系的教师），两人一起举办了一个夏令营，旨在帮助那些有创业念头的大学生成立自己的公司。入选者都将得到他们的悉心指导以及5 000美元的资助。</p>\n<p> 申请表有227份，他们从中挑了8个项目。等到夏令营结束的时候，有4个项目已经做得很像样了。社会化地理服务网站路谱网后来得到了两家风投公司共1 300万美元的投资，截至2010年底有400万用户；用户聚合的新闻网站红迪网2006年被大型出版集团Condé Nast以1 000多万美元的价格收购，目前位于全美百大网站之列；移动支付服务网站TextPayMe 2006年被亚马逊收购；在线日历网站Kiko是该领域的先锋，后来由于谷歌推出同类产品而被迫把源码放到eBay上拍卖，卖出了25.8万美元。</p>\n<p> 结果令人鼓舞，格雷厄姆觉得可以把这件事情做下去，将扶植创业公司作为一项事业。于是，他和莫里斯、布莱克韦尔以及杰西卡·利文斯顿<span class=\"comment-number\">2</span>合伙在硅谷成立了Y Combinator<span class=\"comment-number\">3</span>（简称YC）。根据格雷厄姆的设想，它既是一个创业公司的孵化器，也是一个教导员，还是一个与投资人联系的中介。</p>\n\n\n<p> YC在每年的1月和6月举办两次训练营，每次为期3个月。通常每次大概有500个申请者，他们从中挑出20个项目<span class=\"comment-number\">4</span>。每个项目将得到1.1万美元的启动资金，外加每个项目成员3 000美元的生活津贴，交换条件是YC将拿走该项目5%的股份<span class=\"comment-number\">5</span>。如果项目成功，5%的股份将非常值钱。</p>\n\n\n<p> YC的合伙人对每个项目都单独进行辅导，不仅提供项目建议，还灌输方法论和价值观。每个星期四下午，创业者来到YC的办公室，与格雷厄姆或者其他某个合伙人见面，报告项目的进展，然后一起讨论如何解决一些棘手的问题。</p>\n<p> 面谈结束以后，就是聚餐时间。所有人一边吃饭，一边聊天。同时，还有特邀嘉宾与创业者见面。嘉宾往往是技术行业的顶尖名人，比如Facebook的创始人马克·扎克伯格（Mark Zuckerberg）、Groupon的创始人安德鲁·梅森（Andrew Mason）等。</p>\n<p> 3个月的训练营接近尾声时，按照计划，创业者应该拿出一个可以运行的成果。YC到时会举行“展示日”，让风险投资商与创业者直接见面。创业者在台上展示自己的项目，风投在台下进行评估，有意向的话，双方再进行私下接触。</p>\n<p> 业界对YC毕业生的投资热情在“展示日”表现得一览无遗。最初，只有格雷厄姆的朋友和以前的同事参加，后来申请参加的人越来越多，硅谷几乎所有重要的风投公司和天使投资人都来了，以至于150人的会场坐不下，“展示日”不得不延长至3天，而每个项目只有两分半钟的自我介绍时间。2010年8月，YC孵化出的新一届36家创业公司，有30家得到了风险投资，很多超过了100万美元。</p>\n<p> 到目前为止，从YC“毕业”的创业公司共有200多家，其中失败的公司不到20%，远低于90%的业内平均水平。这些YC学员成为新一代硅谷创业公司的主流，他们组成了一张不断壮大的关系网，有人把这些迅速崛起的硅谷新成员称为“YC匪帮”。</p>\n<p> YC已经改写了创业家和硅谷投资者之间的旧秩序，塑造了创建技术公司的新范式。在科技快速发展、资本不断涌入的大背景下，它使得创业公司规模更小、成本更低、行动更快。</p>\n<p> 从2005年至今，格雷厄姆本人面试过的创业者接近2 000人，他在某种程度上已经是硅谷的中心人物，有着巨大的影响力。他的文章在美国创业者中广为流传，年轻的技术人员阅读他的书，了解他的思想，讨论他的观点。</p>\n<p> 这种变化在硅谷引起了不同的反应。2010年9月，著名科技博客TechCrunch的主编迈克尔·阿灵顿（Michael Arrington）揭露了一场发生在旧金山某酒吧的秘密聚会，一群显赫的天使投资人抱怨YC的势力太过显赫，抬高了风投业的整体估值水平。他们密谋如何压制竞价，把创业公司的估值降下来。另外，2011年1月，著名天使投资人尤里·米尔纳（Yuri Milner）宣布，将向YC的每一个创业项目提供15万美元资金，没有任何前提条件，唯一的要求就是如果这些项目有下一次融资，这15万美元将获得同等待遇，转为股份。从这两件事上，YC的风头之劲可见一斑。</p>\n<p> 保罗·格雷厄姆有一套完整的创业哲学，他的创业公式是：</p>\n<p> （1）<strong>搭建原型；</strong></p>\n<p> （2）<strong>上线运营（别管bug）；</strong></p>\n<p> （3）<strong>收集反馈；</strong></p>\n<p> （4）<strong>调整产品；</strong></p>\n<p> （5）<strong>成长壮大。</strong></p>\n<p> 首先，他鼓励创业公司快速发布产品，因为这样可以尽早知道一个创意是否可行。其次，他认为一定要特别关注用户需要什么，这样才有办法将一个坏项目转变成好项目。他说：“许多伟大的公司，一开始的时候做的都是与后来业务完全不同的事情。乔布斯创建苹果公司后的第一个计划是出售计算机零件，然后让用户自己组装，后来才变成开发苹果计算机。你需要倾听用户的声音，琢磨他们需要什么，然后就去做。”所有学员刚刚来到YC的时候，每人都会拿到一件白色T恤衫，上面写着“Make something people want”（制造用户需要的东西），等到他们的项目得到风险投资以后，又会收到一件黑色T恤衫，上面写着“I made something people want”（我制造了用户需要的东西）。</p>\n<p> 比起那些令人叫好的创意，格雷厄姆更看重创始人的素质。他说：“我们从一开始就认识到，创始人本身比他的创意更重要。”他还认为，小团队更容易成功，创始人总数最好不要超过三个。其中一个原因是，创始人越多，股权越不容易平等分配，容易造成内耗。</p>\n<p> 格雷厄姆认为，我们正在进入一个创业时代。未来的社会，创业可能成为一种常态，而替别人打工反而成了少见的事情。一方面，创业是最有效的创造财富的方法，对创始人、投资者和社会都是如此。“如果拉里·佩奇（Larry Page）和谢尔盖·布林（Sergey Brin）没有创立谷歌，那么他们可能还在某个研究部门工作，写一些不会有多少人使用的代码。但是，他们选择了创业，想一想这样做为全世界增加了多少价值？”另一方面，创业越来越简单了，成本也越来越低。“以前创业很昂贵，你不得不找到投资人才能创业。而现在，唯一的门槛就是勇气。”</p>\n<p> 格雷厄姆认为，对于科技公司来说，未来充满了机会，前景一片光明。“所有东西都在变成软件。印刷机诞生后，人类写过多少个字，未来就有多少家软件公司。”</p>\n<p style=\"text-align: right\"><strong>作者：阮一峰</strong></p>\n\n<br style=\"page-break-after:always\" />","comments":[]}