{"id":740991,"title":"推荐序 “黑客精神”过时了吗？答案是永远不会","content":"\n<p> 《黑客与画家》是保罗·格雷厄姆18年前写的散文集，但对于今天中国的年轻人，它在思考和行动上依然具有深远的指导意义，因为它本质上讲的是“创新”和“创造者思维”。如今，中国正在进入高速发展的技术驱动时代，年轻人尤其需要用技术驱动的方式来创造价值。</p>\n<p> 我很高兴有机会为这本书写序。我与保罗的缘分由来很久，今天我在中国全力打造的奇绩创坛也和他有着密不可分的关系。</p>\n<p> 1998年，我认识了保罗。当时他的公司被雅虎并购，因此我们成了同事，他就坐在我附近。2005年，保罗创立Y Combinator（简称“YC”）的时候，为了鼓励创业者，我代表雅虎表示支持，并去哈佛大学做了讲座，同时结识了YC的首届创业者——亚历克西斯·奥哈尼安（Alexis Ohanian，论坛网站Reddit的联合创始人）和山姆·阿尔特曼[Sam Altman，Loopt联合创始人，后来担任了YC的掌门人，并与埃隆·马斯克（Elon Musk）联合创立了OpenAI，这也是YC全球研究院孵化的第一个研究驱动型企业]。我跟YC从此结下了不解之缘。</p>\n<p> 后来，我在微软工作期间，一直跟YC和山姆保持联系，心里也逐渐埋下了一颗种子：未来，当我开启职业生涯的第二阶段（一份可以做到70岁以上的工作）时，我希望可以去服务创业者。</p><!-- [[[read_end]]] -->\n<p> 2018 年，我创立了YC中国（后更名为奇绩创坛）。在过去几年中，我和我优秀的团队亲手验证了保罗的核心理念，并将YC的创造性思维在中国有效落地。在两年时间里，奇绩创坛已经投资并加速了200多家以技术驱动为主的创业公司，这些公司都有很大的潜能和出色的创始人，他们代表着中国技术驱动创新的未来，相信他们会为中国的发展做出卓越的贡献。</p>\n<p> 同时，保罗创立的YC在过去17年间从根本上改变了“创新”这个概念。到目前为止，YC是全球唯一一个可以实现规模化的创业加速器，它极大地帮助技术驱动型创业者提高了成功率，尤其是那些“从0到1”的初创公司，这些公司包括爱彼迎、Stripe、Dropbox、DoorDash和Coinbase等。在美国等很多国家，在过去17年里，有大量优秀的技术驱动型创业公司从YC体系中破茧而出，这一切都跟保罗深度的哲理性思维和对未来的独特洞察力分不开。你可以在这本书里找到更具象的描述，相信它会给你带来启发。</p>\n<p> 这本书主要是保罗写给程序员的，但值得所有人一读。它足够通俗易懂，深入浅出，行文也非常生动活泼。保罗是一个身怀大智慧的人，他一直想成为一位散文作家，所以书中运用的语言朴实简单。他很会穿针引线，比如一个你需要琢磨很久的大道理，他却能用非常简单的例子去描述，并打动你、启发你。</p>\n<p> 我建议读者从三个维度去看这本书：第一是“黑客精神”和“创造者思维”；第二是“财富创造”；第三是“开拓未来”。</p>\n<p> “黑客精神”是这本书的核心理念所在。“黑客”本身具有各种各样的描述和象征意义。在不同场景下，人们对“黑客”的定义也不一样。在保罗的观念里，以及在YC和奇绩创坛的实践观察中，我们发现，黑客精神的真谛是动手去创造性地解决问题。“解决问题”必须跟人的需求有关，需要持久地满足越来越多人的需求。“动手”需要有勇气，很务实，以行动为导向，除此以外，黑客还必须是一个积极向上的人。“创造性”则意味着不受束缚、敢于探索。此外，黑客精神还意味着独立思考，坚持说真话。“动手去创造性地解决问题”代表了创造者一系列的核心行为和思想状态。这句话虽然听上去很简单，但它具有深刻含义，且完全反映了创造者的核心要素。</p>\n<p> 黑客精神在我们这个时代主要通过数字化、软件和代码开发来实现。黑客一开始其实只是以软件为主，后来延伸到硬件，并逐步拓展到其他创新领域。人类历史已经进入了数字化时代，这一时代是历史的长河，是人性的延伸，是势不可当的长期趋势。在过去20多年里，众多前人已经验证了这本书里的理念，比如“用软件来驱动一切”。第3章《不能说的话》、第12章《拒绝平庸》、第13章《书呆子的复仇》和第15章《设计与研究》都深入浅出地阐述了什么是“创造者思维”。我建议读者不光要在理性上知道创造者思维包含哪些维度，更要去感性地体验创造者思维是如何产生的。这种思维常常能在大家创业、创新的过程中展现出来。</p>\n<p> 第二个维度是“财富创造”，保罗着重强调并仔细讨论了“设计”和“品味”的重要性。设计是技术和人类需求的桥梁，只有通过好的设计，技术才能源源不断地满足需求。优秀的产品设计可以起到核心桥梁的作用。我觉得品味是保罗智慧的体现，大部分人没有意识到品味有多重要，保罗则认为，能设计的人很多，但是有品味的人却很少。不论是画家还是工程师黑客，真正能创造的人都是可以把控品味的。他们足够了解什么是优秀的，什么是不够好的，而这些人不做到优秀就永不罢休。创造财富是改变世界更高效的途径——我建议读者从这个维度去思考。第2章《黑客与画家》、第6章《如何创造财富》、第12章《拒绝平庸》、第15章《设计与研究》，特别是第9章《设计者的品味》，这几章都值得大家反复斟酌。</p>\n<p> 第三个维度是“开拓未来”，尤其是运用第一性原理，能够让人类更快地演进和发展，离终局越来越近。保罗关注的核心是编程语言，因为它是这个时代的核心创造工具，是创造者思考的基石，也是创造者进化和演变的核心环境。</p>\n<p> 以软件为主的创造者是比较特殊的一群人，他们的进化跟语言是分不开的，尤其是跟编程语言密不可分。保罗的博士论文写的是Lisp语言的编译器，Y Combinator 这个名字也来自Lisp语言。我还记得，保罗为了进一步开发 Lisp语言，在雅虎专门留了一个工位，请美国加利福尼亚大学伯克利分校的一位教授每周来一次，他跟教授一起讨论开发Lisp语言编译器。自2014 年从 YC退休之后，直到今天，保罗还在英国继续开发Lisp语言。</p>\n<p> 保罗认为，从数学和第一性原理来讲，Lisp是最接近长期真理的，将来创造者的进化会依靠编程这个工具，而最优的进化路径能让我们展望更遥远的未来。书里的这部分可能描述得有一点点专业，更适合软件工程师阅读，但是他讲得足够生动活泼。如果有时间，我建议所有读者仔细品读第11章《一百年后的编程语言》和第14章《梦寐以求的编程语言》。</p>\n<p> 保罗和YC无疑开启了技术驱动创新的新纪元。在全球范围内，创新都在进一步加速，中国也迎来了独特的历史发展机遇，希望年轻一代人可以结合我们的国家制度、政策环境、文化和社会发展目标，将保罗的理念灵活应用。期待每一位读者都能积累更丰富的体验，更有效地品鉴这本书的价值。</p>\n<p style=\"text-align: right\"><strong>陆奇</strong></p>\n<p style=\"text-align: right\"><strong>奇绩创坛创始人兼CEO</strong></p>\n<p style=\"text-align: right\"><strong>2022年4月</strong></p>\n\n<br style=\"page-break-after:always\" />","comments":[]}