{"id":740996,"title":"前言","content":"\n<p> 本书尝试解释计算机世界发生了什么事，所以，它不仅仅是写给程序员看的，也适合所有人。比如，第6章讲如何致富，我相信这是所有读者普遍感兴趣的内容。</p>\n<p> 你可能注意到了，过去30年中，很多赚到大钱的人都是程序员，比如比尔·盖茨、史蒂夫·乔布斯、拉里·埃里森。为什么？为什么是程序员，而不是土木工程师，或者摄影师，或者精算师？第6章将告诉你答案。</p>\n<p> 软件带来财富，仅仅代表了大趋势的一面而已。这种大趋势就是本书的主题。我们的时代是计算机时代。以前，人们曾经认定这个时代应该是太空时代或者原子时代。但是事实证明，它们只是公关公司发明的概念。计算机对人类生活的影响远远超过了太空航行或者原子技术。</p>\n<p> 我们生活中的一切，都正在成为计算机。打字机被计算机取代了，电话也变成了计算机，照相机亦是如此。很快，电视机也将变成计算机。当今小轿车所具备的计算能力比1970年占满一间屋子的大型计算机还要强。信件、百科全书、报纸，甚至本地的小店，都正在被互联网取代。所以，如果你想理解我们目前的世界以及它的未来动向，那么多了解一些黑客的想法会对你有帮助。</p>\n<p> 黑客？那不是侵入他人计算机的人吗？在外行人看来，这个词的意思就是这样。但是在计算机世界中，黑客指的是专家级程序员。因为本书的目的是解释真实的计算机世界是怎么一回事，所以我决定冒着被误解的风险，按照行业内的定义使用这个词。</p><!-- [[[read_end]]] -->\n<p> 本书的前几章回答了一些大家可能都想过的问题。怎样创业才会成功？技术是否造成了技术人员与普通人之间的隔阂？程序员到底在做些什么？为什么那些读高中时普普通通的学生，最终却摇身一变成了世界上最有影响力的人士？微软公司会控制互联网吗？怎样才能对付垃圾邮件？</p>\n<p> 本书后面几章谈的是大多数非计算机行业的人士没有想过的问题——编程语言。为什么普通人要去关心编程语言？因为如果你想了解黑客，就必须懂一点编程语言。这就好比回到1880年，如果你想理解技术发展，就必须懂一点蒸汽机。</p>\n<p> 计算机程序只是文本而已。你选择什么语言，决定了你能说什么话。编程语言就是程序员的思维方式。</p>\n<p> 因此很自然，编程语言对程序员的思想有巨大的影响。你从他们写的软件中就可以看出来。旅游网站Orbitz成功打入了竞争激烈的网络订房订票市场。该市场原先被两大巨头主宰，一个是微软公司，另一个是拥有几十年电子预订服务经验的Sabre。Orbitz是怎么从它们手中抢到市场的？最主要的原因就是它使用了一种更好的编程语言。</p>\n<p> 根据使用的语言不同，程序员往往会被分成不同的派别。人们区分程序员甚至不是看他们写了什么程序，而是看他们使用什么语言。所以，声称一种语言优于另一种语言被认为是不礼貌的行为。但是，没有一个编程语言的设计者会相信“不同的语言各有千秋”这种文绉绉的客套话。我将直言不讳地说出自己对于编程语言的看法，这也许会令很多人不快，但是如果想要理解黑客，我真的觉得没有其他更好的方法。</p>\n<p> 有些读者可能不理解第3章的内容。这一章与计算机有什么关系？事实是黑客很在乎言论自由。Slashdot（它是黑客世界的《纽约时报》）有一个专栏讨论这个问题。我想Slashdot的大多数读者认为重视言论自由是天经地义的事情。不过《飞机与飞行员》（<em>Plane &amp; Pilot</em>）杂志就肯定不会有一个这样的栏目。</p>\n<p> 为什么黑客那么在乎言论自由？我认为，部分原因在于，革新对于软件行业实在是太重要了，而革新和异端实际上是同一件事。优秀的黑客养成了一种质疑一切的习惯。这是肯定的，因为如果你不得不同一台机器打交道，而这台机器全部由文字组成，像机械式手表一样复杂，并且规模大出1 000倍，那么你也会养成这种习惯的。</p>\n<p> 此外，我还认为，行为怪异的人和愤世嫉俗的人比普通人更可能成为黑客。计算机世界就像是智力世界的大西部，在那里没有你不敢想的事情，只要你愿意承担冒险的后果。</p>\n<p> 如果我成功实现了自己对这本书的设想，那么它也将是一片智力世界的大西部。我不希望你带着某种压迫感来阅读本书，心里想着：“没办法，这些书呆子看上去正在接管世界。我最好能懂一点他们正在干的事情，这样就不会被他们整出来的下一个东西唬到了。”如果你喜欢思考，阅读本书应该会带给你很多乐趣。虽然黑客从外表看上去一般都是呆呆的，但是他们的大脑内部却是一个有趣得让你吃惊的地方。</p>\n<p style=\"text-align: right\"><strong>写于马萨诸塞州坎布里奇</strong></p>\n<p style=\"text-align: right\"><strong>2004年4月</strong></p>\n\n<br style=\"page-break-after:always\" />","neighbors":{"left":{"article_title":"致读者","id":740995},"right":{"article_title":"第一部分 黑客如何成长及看待世界","id":740997}},"comments":[]}