{"id":830225,"title":"结束语｜保持前端人的自信，把握机遇！","content":"<p>你好，我是柳博文。</p><p>我们的《前端工程师的AI实战课》即将结束。相比过去比较随心所欲地写博客，这也是我第一次挑战体系化课程的输出方式，也是对我过往经验的一次系统梳理。更新期间也很开心看到不少同学留言交流，这个过程也让我学到了很多。</p><p>我花了一些时间思考，要怎么写这个结束语，才能有一个相对完美的Ending。所谓“文无定法，诗无达诂”，盖唯诚可至。今天，我想与你说一些交心的话，分享一些我自己对前端以及AI+前端的独立思考。</p><h2>你觉得前端应该被“资源化”么？</h2><p>前端开发这一角色，相对于技术需求链上的其他角色来说，常常会被定义为一种“资源”，所以存在感相对比较弱。</p><p>这样的定义在很多前端工程师心中都是一个不愿面对的事实，因为我们大多数前端工程师是对技术充满自信的，也一直在追求属于自己的技术高光。这种内在动力激励着我们不断进步，在前端领域中探索新知、总结经验，进而在行业中体现出我们的专业价值和存在感。</p><p>“资源”二字其实曾困扰过我很长一段时间。我曾坚定地认为，前端工程师不应仅仅被当作资源使用，而是需要在技术上有所建树，拥有属于自己的技术亮点。然而，在这种思考中，我一度忽视了一些更为根本的问题：我们编写前端代码的目的究竟是什么？我们为谁服务？前端工程师的工作到底是面向用户编程，还是面向开发者编程？</p><!-- [[[read_end]]] --><p>这两种思路我们无法同时做到完美，这也是每个前端技术人在工作中都会遇到的两难选择。正如你可能同样感受到的，开发者友好和用户友好之间如何取舍，一直是前端技术发展中的热议话题。</p><h2>前端的定义在不断进化</h2><p>不可否认，两种思路都各有其合理性和价值。然而在当前的技术发展趋势下，我认为用户友好可能显得更加重要。</p><p>随着前端技术的不断进步，产品需求开始愈发靠前，后端服务则逐渐向后靠拢。在这样的背景下，前端作为用户与产品直接交互的门户角色，其重要性也愈发凸显。可以说，这为我们前端工程师提供了一个难得的机会，使得我们能够直接影响用户体验，从而为产品的成功贡献力量。</p><p>当然，机会的背后也是挑战。作为前端工程师，需要涉猎的领域变得更加广泛，不仅要精通前端技术，还要具备一定的后端技能。诸如许多大厂现在要求前端能够编写 API 接口，甚至需要掌握 SQL 进行简单的数据处理。这种趋势反映了现代产品开发的复杂性和对全栈能力的需求。</p><p>更为显著的是，一些企业已经开始将招聘职位的 title 从“前端工程师”改为“应用工程师”，这一变化标志着对前端工程师提出了更高的要求。</p><p>现代前端工程师不再仅仅是编写 HTML、CSS 和 JavaScript 的“切图工”，而是需要具备全面的应用开发能力，能够从用户需求到数据处理再到接口设计，提供完整的解决方案。这种全栈式的发展趋势无疑给前端工程师带来了新的挑战，但也为我们拓展技术能力、提升职业价值提供了更广阔的空间。</p><h2>“前端智能化”开始凸显</h2><p>前端这个方向，相比服务端等来说是相对“新”且“宽”的，近几年现代前端框架的发展和市场占比开始趋于稳定，当然新势力仍在不断涌出。</p><p>大厂的技术专家们的视角开始从纯技术层面转向更为广泛的体系化的产研流程上。这时，前端开始走向深水区，同时，前端技术开始将服务对象从 “开发者” 逐渐转向 “产品用户”。这是需求发展和技术更新的必然结果，也是我们前面提出的“我们为谁服务”问题的一个答案。</p><p>于是前端这个方向有了更深入的细分领域——前端工程化、性能优化、Serverless与边缘计算、音视频、低代码或无代码、<strong>前端智能化</strong>等等。</p><p>其中<strong>前端智能化</strong>这个细分方向是我比较看好的，它在各类技术大会上也不断地作为独立的论点被提出。在前端工程师的日常工作里引入 <strong>AI模型成为一个趋势，</strong>各种创新的实践也在不断涌现。</p><p>不过即便如此，我仍感受到前端业界对于这个创新领域仍处在观望状态，甚至不怎么信任。一部分人仍然把AI看成探索性的玩具，然而真实线上业务里AI自动出码（比如营销活动里前端模块的自动出码）已经成为现实。</p><p>当然，当前的AI+前端方面的实践也有一定门槛，既需要多种算法模型的结合以及丰富的物料支持，也需要配备拥有一定AI背景和专业能力的人员做好算法协同的调度工作。</p><h2>“AI+前端”变得更加务实和落地</h2><p>时至今日，在AI大模型迅猛发展的今天，相信你已经亲身感受到了AI的强大力量。这不仅为许多行业带来了颠覆性的变化，也为我们前端工程师带来了全新的机遇和挑战。</p><p>AI 已经由传统的模型发展为了更为通用的大模型。AI大模型让“前端智能化”更加务实和落地，AI+前端的可行性也比过去更高了。在工程链路、端侧智能等方面各类创新应用如雨后春笋般涌出。</p><p>前端开发与AI的结合，不再局限于简单的工程链路实现和页面交互，而是可以利用AI进行数据分析、智能推荐、图像处理等与UI深度结合的更复杂的任务。</p><h4>如何应对最新的趋势变化</h4><p>作为前端工程师的我们，抓住“AI+前端”这个结合方向，不仅可以为日常开发工作和需求实现提供新的思路，同样也是一个给未来做长线投资的选择。</p><p>懂得如何将AI与前端技术结合的工程师，将在未来的职场中拥有更强的竞争力，占据技术的前沿。学习并掌握AI技术，前端工程师不仅能提升自身的技术深度，为产品创新贡献独特的价值，也能为职业发展开拓更多可能性。</p><p>基于这一点，我提出了AI＋前端的课程思路，希望帮助前端工程师们学习并掌握AI技术，让更多人消除对AI领域的畏难心理。在AI的必然发展趋势的背景下，我相信AI与前端结合的应用还会越来越多。只要仍在人机交互的模式中，“前端”的作用就至关重要。</p><p>念念不忘，必有回响。愿大家保持前端人的自信，把握AI创新的机遇，勇立潮头！</p><p>再次感谢你对课程的支持和订阅，希望这门课让你对“AI+前端”领域有些新的领悟。课程的尾声，期待能够听到你的反馈，为此我准备了一份<a href=\"https://jsj.top/f/kpRHcP\">毕业问卷</a>，希望你能花几分钟填写一下。</p><p><a href=\"https://jsj.top/f/kpRHcP\"><img src=\"https://static001.geekbang.org/resource/image/0b/0c/0babe9eeefb0d28009a8f91ecec9c50c.jpg?wh=1142x801\" alt=\"\"></a></p>","neighbors":{"left":{"article_title":"答案锦集（二）｜思考题答案汇总","id":829946},"right":{"article_title":"结课测试｜来赴一场满分之约！","id":830228}},"comments":[]}